name = "Dachi" 
age = 9
number = 15 + 5
print(name)
print(number)

# შეცდომების გასწორებას ქვია დებაგინგი

# snake_case language
# case sensitive language 
# 1) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ გაანახლეთ ამ ცვლადის მნიშვნელობა ორჯერ, საბოლოოდ კი დაპრინტეთ ეს ცვლადი.

points = 50 
sum = (points * 2) 
print(sum)

# 2)კომენტარებით ახსენით რას ნიშნავს snake_case, როდის ვიყენებთ და მოიყვანეთ 3 მაგალითი.
# სიტყვების დასაცილებლად ვიყენებთ ქვედა ტირეს პითონში
my_name = "Dachi"
my_username = "DachiKublashvili"
back_to_work = "Teacher" 

# 3)დაწერეთ 10 ხაზი კოდი (შეცდომებით) და ქვემოთ მიუწერეთ სწორი ვერსია.


name = "Dachi" #არასწორი "Dachi ან Dachi"
print(name)
sum = 50+5  #არასწორი "50+5" ან "50+5 ან 50+5"
print(sum)
age = "5" + "5"  #არასწორი "5"+ 5 ან 5 + "5"
print(age)
my_cat_name = "Katze" #არასწორი "Katze +
print(my_cat_name) 
level = (5*5) + (2*5) + (25/5) #არასწორი "(5*5) + (2*5) + (25/5)
print(level) 

# 4)შექმენით ცვლადი სადაც შეინახავთ თქვენს საყვარელ რიცხვს, შექმენით მეორე ცვლადი სადაც შეინახავთ თქვენს ასაკს და შექმენით მესამე ცვლადი სადაც შეინახავთ ამ ცვლადების ნამრავლს.

my_num = 10*10 
age =  9
sum = (10*10)*9 
print(sum)

# 5)ცვლადების მეშვეობით დაბეჭდეთ მათემატიკური გამოსახულებელი, ყველა განვილილი მათემატიკური ოპერატორით. 

sum = 2*5 + 10/5 + 25-5 + 5+5
print(sum) 